# class - 1) Pandas Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
# You can convert a list,numpy array, or dictionary to a Series:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
#1.1.2  Using NumPy Arrays

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [9]:
# 1.1.3  Using Dictionaries

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
# 1.1.4  Data in a Series
# A pandas Series can hold a variety of object types:

In [12]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [13]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

# 1.2  Using an Index
The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [14]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [15]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [17]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [20]:
ser1['USA']

1

# Operations are then also done based off of index:

In [19]:
ser1 +ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [21]:
#############################################################################################################

# class 2) DataFrames
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [22]:
import pandas as pd
import numpy as np

In [125]:
from numpy.random import randn
np.random.seed(101)

In [126]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [127]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [128]:
# 1.1  Selection and Indexing
#Let's learn the various methods to grab data from a DataFrame

In [129]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [130]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [131]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

 DataFrame Columns are just Series

In [132]:
type(df['W'])

pandas.core.series.Series

# 1.1.1  Creating a new column:

In [133]:
df['new'] = df['W'] + df['Y']

In [134]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [135]:
###### removing   columns

In [136]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [137]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [138]:
df.drop('new',axis=1,inplace=True)

In [139]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

can also drop along row

In [140]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

# selecting Rows

In [141]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Or select based off of position instead of label

In [142]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [143]:
# 1.1.4  Selecting subset of rows and columns

In [144]:
df.loc['B','Y']

-0.8480769834036315

In [145]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [146]:
# 1.1.5  Conditional Selection
# An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [147]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [148]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [149]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [150]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [151]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [152]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [153]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

# 1.2  More Index Details

7  Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!¶

In [154]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [155]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [156]:
newind = 'CA NY WY OR CO'.split()

In [157]:
df['States'] = newind

In [158]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [159]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [160]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [161]:
df.set_index('States',inplace=True)

In [162]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# 1.3  DataFrame Summaries

There are a couple of ways to obtain summary data on DataFrames.
df.describe() provides summary statistics on all numerical columns.
df.info and df.dtypes displays the data type of all columns

In [163]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [164]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [167]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [166]:
################################################################################################################################

# Class -3) Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [6]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [8]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [9]:
#############################################################################

# Class- 4

# 1  #Groupby
The groupby method allows you to group rows of data together and call aggregate functions

In [10]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [13]:
df.groupby('Company')

In [14]:
by_comp = df.groupby("Company")

In [15]:
by_comp

In [16]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [17]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [19]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [20]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [21]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [23]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [24]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [26]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [33]:
by_comp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [43]:
df.groupby('Company').describe()['Sales'].loc[['FB','GOOGLE'],['mean','std']]

C:\Users\Kisalay\.conda\envs\pytorchenv\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

          mean        std
Company
FB       296.5  75.660426
GOOGLE     NaN        NaN

In [ ]:
########################################################################################

# Class - 5)

# 1  Operations
There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [49]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [50]:
# 1.0.1  Info on Unique Values

In [51]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [52]:
df['col2'].nunique()

3

In [53]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [54]:
# 1.0.2  Selecting Data

In [55]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [56]:
newdf

   col1  col2 col3
3     4   444  xyz

In [57]:
# 1.0.3  Applying Functions

In [58]:
def times2(x):
    return x*2

In [59]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [60]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [61]:
df['col1'].sum()

10

In [62]:
# 1.0.4  Permanently Removing a Column

In [63]:
del df['col1']

In [64]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

1.0.5  Get column and index names:

In [65]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [68]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [69]:
# 1.0.6  Sorting and Ordering a DataFrame:

In [70]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [71]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [72]:
####################################################################################

# Class 6

In [2]:
import numpy as np
import pandas as pd

# 1.1  CSV

Comma Separated Values files are text files that use commas as field delimeters.
Unless you're running the virtual environment included with the course, you may need to install xlrd and openpyxl.
In your terminal/command prompt run:

conda install xlrd
conda install openpyxl
Then restart Jupyter Notebook. (or use pip install if you aren't using the Anaconda Distribution)

In [3]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df.to_csv('example.csv',index=False)

In [5]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [1]:
!pip install xlrd==1.2.0

Requirement already satisfied: xlrd==1.2.0 in c:\users\kisalay\.conda\envs\pytorchenv\lib\site-packages (1.2.0)

In [79]:
!pip install openpyxl

Collecting openpyxl
  Downloading https://files.pythonhosted.org/packages/5c/90/61f83be1c335a9b69fa773784a785d9de95c7561d1661918796fd1cba3d2/openpyxl-3.0.5-py2.py3-none-any.whl (242kB)
Collecting et-xmlfile (from openpyxl)
  Using cached https://files.pythonhosted.org/packages/22/28/a99c42aea746e18382ad9fb36f64c1c1f04216f41797f2f0fa567da11388/et_xmlfile-1.0.1.tar.gz
Collecting jdcal (from openpyxl)
  Using cached https://files.pythonhosted.org/packages/f0/da/572cbc0bc582390480bbd7c4e93d14dc46079778ed915b505dc494b37c57/jdcal-1.4.1-py2.py3-none-any.whl
Building wheels for collected packages: et-xmlfile
  Building wheel for et-xmlfile (setup.py): started
  Building wheel for et-xmlfile (setup.py): finished with status 'done'
  Stored in directory: C:\Users\Kisalay\AppData\Local\pip\Cache\wheels\2a\77\35\0da0965a057698121fc7d8c5a7a9955cdbfb3cc4e2423cad39
Successfully built et-xmlfile
Installing collected packages: et-xmlfile, jdcal, openpyxl
Successfully installed et-xmlfile-1.0.1 jdcal-1.4.1 openpyxl-3.0.5

In [6]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

#  HTML

In [7]:
!pip install lxml
!pip install html5lib
!pip install beautifulsoup4

Requirement already satisfied: lxml in c:\users\kisalay\.conda\envs\pytorchenv\lib\site-packages (4.6.2)
Collecting html5lib
  Downloading https://files.pythonhosted.org/packages/6c/dd/a834df6482147d48e225a49515aabc28974ad5a4ca3215c18a882565b028/html5lib-1.1-py2.py3-none-any.whl (112kB)
Requirement already satisfied: webencodings in c:\users\kisalay\.conda\envs\pytorchenv\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\kisalay\.conda\envs\pytorchenv\lib\site-packages (from html5lib) (1.15.0)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Collecting beautifulsoup4
  Downloading https://files.pythonhosted.org/packages/d1/41/e6495bd7d3781cee623ce23ea6ac73282a373088fcd0ddc809a047b18eae/beautifulsoup4-4.9.3-py3-none-any.whl (115kB)
Collecting soupsieve>1.2; python_version >= "3.0" (from beautifulsoup4)
  Downloading https://files.pythonhosted.org/packages/02/fb/1c65691a9aeb7bd6ac2aa505b84cb8b49ac29c976411c6ab3659425e045f/soupsieve-2.1-py3-none-any.whl
Installing collected packages: soupsieve, beautifulsoup4
Successfully installed beautifulsoup4-4.9.3 soupsieve-2.1

In [2]:
import pandas as pd

In [11]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [12]:
df

[                                             Bank Name                City  \
 0                                    Almena State Bank              Almena
 1                           First City Bank of Florida   Fort Walton Beach
 2                                 The First State Bank       Barboursville
 3                                   Ericson State Bank             Ericson
 4                     City National Bank of New Jersey              Newark
 5                                        Resolute Bank              Maumee
 6                                Louisa Community Bank              Louisa
 7                                 The Enloe State Bank              Cooper
 8                  Washington Federal Bank for Savings             Chicago
 9      The Farmers and Merchants State Bank of Argonia             Argonia
 10                                 Fayette County Bank          Saint Elmo
 11   Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 12                                      First NBC Bank         New Orleans
 13                                       Proficio Bank  Cottonwood Heights
 14                       Seaway Bank and Trust Company             Chicago
 15                              Harvest Community Bank          Pennsville
 16                                         Allied Bank            Mulberry
 17                        The Woodbury Banking Company            Woodbury
 18                              First CornerStone Bank     King of Prussia
 19                                  Trust Company Bank             Memphis
 20                          North Milwaukee State Bank           Milwaukee
 21                              Hometown National Bank            Longview
 22                                 The Bank of Georgia      Peachtree City
 23                                        Premier Bank              Denver
 24                                      Edgebrook Bank             Chicago
 25                              Doral Bank  En Español            San Juan
 26                   Capitol City Bank & Trust Company             Atlanta
 27                             Highland Community Bank             Chicago
 28                    First National Bank of Crestview           Crestview
 29                                  Northern Star Bank             Mankato
 ..                                                 ...                 ...
 533                                  ANB Financial, NA         Bentonville
 534                                          Hume Bank                Hume
 535                             Douglass National Bank         Kansas City
 536                                  Miami Valley Bank            Lakeview
 537                                            NetBank          Alpharetta
 538                          Metropolitan Savings Bank          Pittsburgh
 539                                    Bank of Ephraim             Ephraim
 540                                      Reliance Bank        White Plains
 541              Guaranty National Bank of Tallahassee         Tallahassee
 542                                Dollar Savings Bank              Newark
 543                               Pulaski Savings Bank        Philadelphia
 544              First National Bank of Blanchardville      Blanchardville
 545                              Southern Pacific Bank            Torrance
 546                        Farmers Bank of Cheneyville         Cheneyville
 547                                      Bank of Alamo               Alamo
 548             AmTrade International Bank  En Español             Atlanta
 549                     Universal Federal Savings Bank             Chicago
 550                       Connecticut Bank of Commerce            Stamford
 551                                   New Century Bank     Shelby Township
 552                              Net 1st National Bank          Boca Raton
 553                                       NextBank, NA             Phoenix
 554                           Oakwood Deposit Bank Co.             Oakwood
 555                              Bank of Sierra Blanca       Sierra Blanca
 556                      Hamilton Bank, NA  En Español               Miami
 557                             Sinclair National Bank            Gravette
 558                                 Superior Bank, FSB            Hinsdale
 559                                Malta National Bank               Malta
 560                    First Alliance Bank & Trust Co.          Manchester
 561                  National State Bank of Metropolis          Metropolis
 562                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date
 0    KS  15426                          Equity Bank    October 23, 2020
 1    FL  16748            United Fidelity Bank, fsb    October 16, 2020
 2    WV  14361                       MVB Bank, Inc.       April 3, 2020
 3    NE  18265           Farmers and Merchants Bank   February 14, 2020
 4    NJ  21111                      Industrial Bank    November 1, 2019
 5    OH  58317                   Buckeye State Bank    October 25, 2019
 6    KY  58112    Kentucky Farmers Bank Corporation    October 25, 2019
 7    TX  10716                   Legend Bank, N. A.        May 31, 2019
 8    IL  30570                   Royal Savings Bank   December 15, 2017
 9    KS  17719                          Conway Bank    October 13, 2017
 10   IL   1802            United Fidelity Bank, fsb        May 26, 2017
 11   WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 12   LA  58302                         Whitney Bank      April 28, 2017
 13   UT  35495                    Cache Valley Bank       March 3, 2017
 14   IL  19328                  State Bank of Texas    January 27, 2017
 15   NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 16   AR     91                         Today's Bank  September 23, 2016
 17   GA  11297                          United Bank     August 19, 2016
 18   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 19   TN   9956           The Bank of Fayette County      April 29, 2016
 20   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 21   WA  35156                       Twin City Bank     October 2, 2015
 22   GA  35259                        Fidelity Bank     October 2, 2015
 23   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 24   IL  57772             Republic Bank of Chicago         May 8, 2015
 25   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 26   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 27   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 28   FL  17557                       First NBC Bank    January 16, 2015
 29   MN  34983                            BankVista   December 19, 2014
 ..   ..    ...                                  ...                 ...
 533  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 534  MO   1971                        Security Bank       March 7, 2008
 535  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 536  OH  16848         The Citizens Banking Company     October 4, 2007
 537  GA  32575                           ING DIRECT  September 28, 2007
 538  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 539  UT   1249                        Far West Bank       June 25, 2004
 540  NY  26778                     Union State Bank      March 19, 2004
 541  FL  26838              Hancock Bank of Florida      March 12, 2004
 542  NJ  31330                          No Acquirer   February 14, 2004
 543  PA  27203                       Earthstar Bank   November 14, 2003
 544  WI  11639                        The Park Bank         May 9, 2003
 545  CA  27094                            Beal Bank    February 7, 2003
 546  LA  16445            Sabine State Bank & Trust   December 17, 2002
 547  TN   9961                          No Acquirer    November 8, 2002
 548  GA  33784                          No Acquirer  September 30, 2002
 549  IL  29355               Chicago Community Bank       June 27, 2002
 550  CT  19183                   Hudson United Bank       June 26, 2002
 551  MI  34979                          No Acquirer      March 28, 2002
 552  FL  26652                       Bank Leumi USA       March 1, 2002
 553  AZ  22314                          No Acquirer    February 7, 2002
 554  OH   8966       The State Bank & Trust Company    February 1, 2002
 555  TX  22002     The Security State Bank of Pecos    January 18, 2002
 556  FL  24382     Israel Discount Bank of New York    January 11, 2002
 557  AR  34248                   Delta Trust & Bank   September 7, 2001
 558  IL  32646                Superior Federal, FSB       July 27, 2001
 559  OH   6629                    North Valley Bank         May 3, 2001
 560  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 561  IL   3815              Banterra Bank of Marion   December 14, 2000
 562  HI  21029                   Bank of the Orient    October 13, 2000

 [563 rows x 6 columns]]

In [7]:
df[0].head()

,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [14]:
df2=pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html',skiprows=[0,3,5])
df2

[                                     Almena State Bank              Almena  \
 0                           First City Bank of Florida   Fort Walton Beach
 1                                   Ericson State Bank             Ericson
 2                                        Resolute Bank              Maumee
 3                                Louisa Community Bank              Louisa
 4                                 The Enloe State Bank              Cooper
 5                  Washington Federal Bank for Savings             Chicago
 6      The Farmers and Merchants State Bank of Argonia             Argonia
 7                                  Fayette County Bank          Saint Elmo
 8    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 9                                       First NBC Bank         New Orleans
 10                                       Proficio Bank  Cottonwood Heights
 11                       Seaway Bank and Trust Company             Chicago
 12                              Harvest Community Bank          Pennsville
 13                                         Allied Bank            Mulberry
 14                        The Woodbury Banking Company            Woodbury
 15                              First CornerStone Bank     King of Prussia
 16                                  Trust Company Bank             Memphis
 17                          North Milwaukee State Bank           Milwaukee
 18                              Hometown National Bank            Longview
 19                                 The Bank of Georgia      Peachtree City
 20                                        Premier Bank              Denver
 21                                      Edgebrook Bank             Chicago
 22                              Doral Bank  En Español            San Juan
 23                   Capitol City Bank & Trust Company             Atlanta
 24                             Highland Community Bank             Chicago
 25                    First National Bank of Crestview           Crestview
 26                                  Northern Star Bank             Mankato
 27              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 28               The National Republic Bank of Chicago             Chicago
 29                                      NBRS Financial          Rising Sun
 ..                                                 ...                 ...
 530                                  ANB Financial, NA         Bentonville
 531                                          Hume Bank                Hume
 532                             Douglass National Bank         Kansas City
 533                                  Miami Valley Bank            Lakeview
 534                                            NetBank          Alpharetta
 535                          Metropolitan Savings Bank          Pittsburgh
 536                                    Bank of Ephraim             Ephraim
 537                                      Reliance Bank        White Plains
 538              Guaranty National Bank of Tallahassee         Tallahassee
 539                                Dollar Savings Bank              Newark
 540                               Pulaski Savings Bank        Philadelphia
 541              First National Bank of Blanchardville      Blanchardville
 542                              Southern Pacific Bank            Torrance
 543                        Farmers Bank of Cheneyville         Cheneyville
 544                                      Bank of Alamo               Alamo
 545             AmTrade International Bank  En Español             Atlanta
 546                     Universal Federal Savings Bank             Chicago
 547                       Connecticut Bank of Commerce            Stamford
 548                                   New Century Bank     Shelby Township
 549                              Net 1st National Bank          Boca Raton
 550                                       NextBank, NA             Phoenix
 551                           Oakwood Deposit Bank Co.             Oakwood
 552                              Bank of Sierra Blanca       Sierra Blanca
 553                      Hamilton Bank, NA  En Español               Miami
 554                             Sinclair National Bank            Gravette
 555                                 Superior Bank, FSB            Hinsdale
 556                                Malta National Bank               Malta
 557                    First Alliance Bank & Trust Co.          Manchester
 558                  National State Bank of Metropolis          Metropolis
 559                                   Bank of Honolulu            Honolulu

      KS  15426                          Equity Bank    October 23, 2020
 0    FL  16748            United Fidelity Bank, fsb    October 16, 2020
 1    NE  18265           Farmers and Merchants Bank   February 14, 2020
 2    OH  58317                   Buckeye State Bank    October 25, 2019
 3    KY  58112    Kentucky Farmers Bank Corporation    October 25, 2019
 4    TX  10716                   Legend Bank, N. A.        May 31, 2019
 5    IL  30570                   Royal Savings Bank   December 15, 2017
 6    KS  17719                          Conway Bank    October 13, 2017
 7    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 8    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 9    LA  58302                         Whitney Bank      April 28, 2017
 10   UT  35495                    Cache Valley Bank       March 3, 2017
 11   IL  19328                  State Bank of Texas    January 27, 2017
 12   NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 13   AR     91                         Today's Bank  September 23, 2016
 14   GA  11297                          United Bank     August 19, 2016
 15   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 16   TN   9956           The Bank of Fayette County      April 29, 2016
 17   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 18   WA  35156                       Twin City Bank     October 2, 2015
 19   GA  35259                        Fidelity Bank     October 2, 2015
 20   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 21   IL  57772             Republic Bank of Chicago         May 8, 2015
 22   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 23   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 24   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 25   FL  17557                       First NBC Bank    January 16, 2015
 26   MN  34983                            BankVista   December 19, 2014
 27   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 28   IL    916                  State Bank of Texas    October 24, 2014
 29   MD   4862                          Howard Bank    October 17, 2014
 ..   ..    ...                                  ...                 ...
 530  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 531  MO   1971                        Security Bank       March 7, 2008
 532  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 533  OH  16848         The Citizens Banking Company     October 4, 2007
 534  GA  32575                           ING DIRECT  September 28, 2007
 535  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 536  UT   1249                        Far West Bank       June 25, 2004
 537  NY  26778                     Union State Bank      March 19, 2004
 538  FL  26838              Hancock Bank of Florida      March 12, 2004
 539  NJ  31330                          No Acquirer   February 14, 2004
 540  PA  27203                       Earthstar Bank   November 14, 2003
 541  WI  11639                        The Park Bank         May 9, 2003
 542  CA  27094                            Beal Bank    February 7, 2003
 543  LA  16445            Sabine State Bank & Trust   December 17, 2002
 544  TN   9961                          No Acquirer    November 8, 2002
 545  GA  33784                          No Acquirer  September 30, 2002
 546  IL  29355               Chicago Community Bank       June 27, 2002
 547  CT  19183                   Hudson United Bank       June 26, 2002
 548  MI  34979                          No Acquirer      March 28, 2002
 549  FL  26652                       Bank Leumi USA       March 1, 2002
 550  AZ  22314                          No Acquirer    February 7, 2002
 551  OH   8966       The State Bank & Trust Company    February 1, 2002
 552  TX  22002     The Security State Bank of Pecos    January 18, 2002
 553  FL  24382     Israel Discount Bank of New York    January 11, 2002
 554  AR  34248                   Delta Trust & Bank   September 7, 2001
 555  IL  32646                Superior Federal, FSB       July 27, 2001
 556  OH   6629                    North Valley Bank         May 3, 2001
 557  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 558  IL   3815              Banterra Bank of Marion   December 14, 2000
 559  HI  21029                   Bank of the Orient    October 13, 2000

 [560 rows x 6 columns]]

In [15]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

In [ ]:
#################################################################################################################################